#+TITLE: Climate Change Explorations
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt,a4paper,titlepage]
#+LATEX_HEADER: \def\today{\number\day\space\ifcase\month\or January\or February\or March\or April\or May\or June\or July\or August\or September\or October\or November\or December\fi \space \number\year}
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage{amssymb,amsmath}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage[round]{natbib}
#+LATEX_HEADER: \usepackage{fancyhdr}
#+LATEX_HEADER: \usepackage{titling}
#+LATEX_HEADER: \usepackage[squaren,cdot]{SIunits}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \pagestyle{fancy}
#+LATEX_HEADER: \renewcommand{\footrulewidth}{0.4pt}
#+LATEX_HEADER: \newcommand{\isotope}[2]{\ensuremath{{^{#1}\mathrm{#2}}}}
#+LATEX_HEADER: \lhead{}
#+LATEX_HEADER: \rhead{}
#+LATEX_HEADER: \lfoot{Climate Change}
#+LATEX_HEADER: \cfoot{\thepage}
#+LATEX_HEADER: \rfoot{\thedate}
#+LATEX_HEADER_EXTRA: \author{Stefan Revets}
#+LATEX_HEADER_EXTRA: \pretitle{\flushleft\LARGE\bfseries\vskip 80mm}
#+LATEX_HEADER_EXTRA: \posttitle{\par}
#+LATEX_HEADER_EXTRA: \preauthor{\flushleft}
#+LATEX_HEADER_EXTRA: \postauthor{\par}
#+LATEX_HEADER_EXTRA: \predate{\flushleft}
#+LATEX_HEADER_EXTRA: \postdate{\par{In Progress}}
#+OPTIONS: ^:{}

*** Boron basics
A boron isotopic standard has been prepared and certified by NIST
\citep{catanzaro-al70:boric}, SRN-951, as boric acid H_{3}BO_{3}, with
an absolute isotopic abundance ratio of 0.2473(2), or 
| isotope         |  proportion |
|-----------------+-------------|
| \isotope{10}{B} | 0.19827(13) |
| \isotope{11}{B} | 0.80173(13) |

\delta\isotope{11}{B} is calculated by
\begin{equation}
\delta\isotope{11}{B}(\permil) = \Bigg(\Bigg( \bigg(\frac{\isotope{11}{B}}{\isotope{10}{B}}\bigg)_{\mathrm{sample}} / 
\bigg(\frac{\isotope{11}{B}}{\isotope{10}{B}}\bigg)_{951}\Bigg) - 1 \Bigg) 1000
\end{equation}

\citet{dickson-goyet94:co2-seawater} listed the standard composition
of seawater as
| Species       | \mole\per\kilogram (sol) | \mole\per\kilogram (H_{2}O) |
|---------------+--------------------------+-----------------------------|
| Cl^{-}        |                  0.54586 |                     0.56576 |
| SO_{4}^{2-}   |                  0.02824 |                     0.02927 |
| Br^{-}        |                  0.00084 |                     0.00087 |
| F^{-}         |                  0.00007 |                     0.00007 |
| Na^{+}        |                  0.46906 |                     0.48616 |
| Mg^{2+}       |                  0.05282 |                     0.05475 |
| Ca^{2+}       |                  0.01028 |                     0.01065 |
| K^{+}         |                  0.01021 |                     0.01058 |
| Sr^{2+}       |                  0.00009 |                     0.00009 |
| B(OH)_{3}     |                  0.00032 |                     0.00033 |
| B(OH)_{4}^{-} |                  0.00010 |                     0.00010 |
| CO_{2}        |                  0.00001 |                     0.00001 |
| HCO_{3}^{-}   |                  0.00177 |                     0.00183 |
| CO_{3}^{2-}   |                  0.00026 |                     0.00027 |
| OH^{-}        |                  0.00001 |                     0.00001 |

In a recent study, \citet{foster-al10:boron} refined the boron numbers
somewhat to a concentration of \unit{432.6}{\micro\mole\per\kilogram}
seawater and specified a \delta\isotope{11}{B} of $39.61\pm
0.04\permil$. From which we deduce the boron isotopic composition of
seawater as
| isotope         | proportion |
|-----------------+------------|
| \isotope{10}{B} | 0.192167   |
| \isotope{11}{B} | 0.807833   |

Boron is present in seawater as boric acid in equilibrium with the
orthoborate ion, as shown in the reaction
\begin{equation}
\mathrm{B(OH)}_3 + \mathrm{H}_2\mathrm{O} \rightleftharpoons \mathrm{H}^+ + \mathrm{B(OH)}_4^-
\label{eqn:borate-equilibrium}
\end{equation}
The equilibrium constant K_{B} for this reaction is temperature and
salinity dependent, and determined by
\citet{dickson90:boric,dickson-goyet94:co2-seawater} as
\begin{equation}
\begin{split}
\ln K_B & = \frac{1}{T}\bigg( -8966.90 - 2890.53\, \sqrt{S} - 77.942\, S + 1.728\, \sqrt{S^3} - 0.0996\, S^2 \bigg) \\
        & + (148.0248 + 137.1942\, \sqrt{S} + 1.62142\, S) \\
        & + (-24.4344 - 25.085\, \sqrt{S} - 0.2474\, S) \ln T \\
        & + 0.053105\, \sqrt{S}\, T
\end{split}
\end{equation}
This equation gives us a means to evaluate the sensitivity of the
equilibrium to changes in salinity and temperature
#+BEGIN_SRC R :file output/boron_pKB.pdf
  lnKB <- function(T, S = 35.0){
      (-8966.9 - 2890.53 * sqrt(S) - 77.942 * S +
       1.728 * S^(3/2) - 0.0996 * S^2) / T +
      (148.0248 + 137.1942 * sqrt(S) + 1.62142 * S) +
      (-24.4344 -25.085 * sqrt(S) - 0.2474 * S) * log(T) +
       0.053105 * T * sqrt(S)
  }

  boron_k <- data.frame(T = seq(275, 300), S = 30.0) %>%
      rbind(data.frame(T = seq(275, 300), S = 32.5)) %>%
      rbind(data.frame(T = seq(275, 300), S = 35.0)) %>%
      rbind(data.frame(T = seq(275, 300), S = 37.5)) %>%
      rbind(data.frame(T = seq(275, 300), S = 40.0)) %>%
      mutate(pKB = -lnKB(T, S) / log(10),
             Salinity = as.factor(S))

  ggplot(boron_k) +
      geom_line(aes(T, pKB, colour = Salinity)) +
      labs(title = "Boric Acid Equilibrium constant in seawater",
           x = "T(Kelvin)",
           y = "pK") +
      theme(legend.position = "bottom")
#+END_SRC
The plot indicates that a difference of \unit{1}{\kelvin} has
approximately the same effect as a difference of \unit{2}{\permil}
salinity on the equilibrium constant (about 3%).

Equation \ref{eqn:borate-equilibrium} can be rewritten so that we can
calculate the concentration of B(OH)^{-}_{4}, assuming a constant
overall boron concentration [B], at present
\unit{0.00043}{\mole\per\kilogram}
\begin{equation}
[\mathrm{B(OH)}^-_4] = \frac{K_B \, [\mathrm{B}]}{[\mathrm{H}^+] + K_B}
\label{eqn:borate_concentration}
\end{equation}
which brings in the dependency on the pH of seawater.

#+BEGIN_SRC R :file output/boron_pH.pdf
  boron_total <- 0.00043
  boron_pH <- data.frame(pH = seq(6, 11, 0.1), T = 283) %>%
      rbind(data.frame(pH = seq(6, 11, 0.1), T = 288)) %>%
      rbind(data.frame(pH = seq(6, 11, 0.1), T = 293)) %>%
      mutate(o_boron = exp(lnKB(T, S = 35)) * boron_total /
                 (10^(-pH) + exp(lnKB(T, S = 35)))) %>%
      mutate(Temperature = as.factor(T))

  ggplot(boron_pH) +
      geom_line(aes(pH, o_boron*1e6, colour = Temperature)) +
      labs(title = "Seawater [o-Borate] pH dependence",
           x = "pH",
           y = expression(paste('[o-Borate] (', mu, 'mol/kg)'))) +
      theme(legend.position = "bottom")
#+END_SRC

As boron is naturally made up by two isotopes, fractionation will take
place in any chemical reaction. That is to say, the equilibium
reaction shown above really is a double reaction:
\begin{equation}
\begin{split}
\isotope{10}{B}\mathrm{(OH)}_3 + \mathrm{H}_2\mathrm{O} & \rightleftharpoons \mathrm{H}^+ + \isotope{10}{B}\mathrm{(OH)}_4^- \\
\isotope{11}{B}\mathrm{(OH)}_3 + \mathrm{H}_2\mathrm{O} & \rightleftharpoons \mathrm{H}^+ + \isotope{11}{B}\mathrm{(OH)}_4^- 
\end{split}
\label{eqn:borate-isotopes}
\end{equation}
The initial attempt to determine the equilibrium cross constant by
\citet{kakihana-al77:ionexchange} found it to deliver a relative
enrichment of \isotope{10}{B} in the anion B(OH)^{-}_{4} with a weak
temperature dependence.

#+tblname: kakihana
|     T | K_isoB |
|-------+--------|
| 273.1 | 1.0206 |
| 278.1 | 1.0204 |
| 288.1 | 1.0199 |
| 298.1 | 1.0194 |
| 313.1 | 1.0187 |
| 323.1 | 1.0182 |
| 333.1 | 1.0177 |

Subsequent additional studies re-evaluated these numbers;
\citet{klochko-al06:fractionation} proposed the
temperature-independent higher value of 1.0272 (or
\unit{27.2}{\permil} enrichment of \isotope{10}{B} of the
B(OH)^{-}_{4}), based on pH measurements of isotopically pure
compounds. The implications of the shift from 1.0194 to 1.0272 on the
calculation of pH, and from there CO_{2} concentrations is
uncomfortably large.

\citet{klochko-al06:fractionation} arrived at their higher values
through pH measurements based on the following reasoning. The
equilibrium equation \ref{eqn:borate-equilibrium} leads directly to
\begin{equation}
\mathrm{pH} = \mathrm{pK}_B + \log \frac{[\mathrm{B(OH)}^-_4]}{[\mathrm{B(OH)}_3]}
\end{equation}
Applying this formula to the equilibrium equation
\ref{eqn:borate-isotopes} we can calculate the differences as
\begin{equation}
\Delta \mathrm{pH} = \mathrm{pK}_{\isotope{11}{B}} - \mathrm{pK}_{\isotope{10}{B}} + \log \frac{[\isotope{10}{B}\mathrm{(OH)}^-_4][\isotope{11}{B}\mathrm{(OH)}_3]}{[\isotope{10}{B}\mathrm{(OH)}_3][\isotope{11}{B}\mathrm{(OH)}^-_4]}
\end{equation}
Here, Klochko makes the assumption that when identical, separate
solutions are made with the two isotopes, then
\begin{equation}
\frac{[\isotope{10}{B}\mathrm{(OH)}_3]}{[\isotope{10}{B}\mathrm{(OH)}^-_4]} = \frac{[\isotope{11}{B}\mathrm{(OH)}_3]}{[\isotope{11}{B}\mathrm{(OH)}^-_4]}
\end{equation}
Clearly, then
\begin{equation}
\Delta \mathrm{pH} = \mathrm{pK}_{\isotope{11-10}{B}}
\end{equation}
allowing the direct measurement through the difference in pH of the
fractionation, as long as the conditions are identical for the two
solutions. Their results in synthetic seawater are

| H_{3}BO_{3} (\mole\per\kilogram) | T (\kelvin) |  K_{\isotope{11-10}{B}} | 2 \sigma | n |
|----------------------------------+-------------+--------+----------+---|
|                             0.01 |         298 | 1.0272 |   0.0006 | 5 |
|                             0.05 |         298 | 1.0257 |   0.0012 | 4 |
|                             0.05 |         298 | 1.0273 |   0.0003 | 4 |
|                             0.05 |         298 | 1.0270 |   0.0019 | 6 |
|                             0.05 |         313 | 1.0269 |   0.0027 | 6 |

while in pure water we get

| H_{3}BO_{3} (\mole\per\kilogram) | T (\kelvin) |  K_{\isotope{11-10}{B}} | 2 \sigma | n |
|-------------+-----+--------+----------+---|
|        0.05 | 298 | 1.0308 |   0.0023 | 6 |
|        0.05 | 313 | 1.0289 |   0.0048 | 6 |

which shows that the ionic strength of seawater, at least at
\unit{298}{\kelvin}, significantly reduces the fractionation as
compared to pure water.

There is an important caveat to be made here. The necessary assumption
that identical solutions of the borate will have identical proportions
of boric acid to the borate ion is not verified. More importantly,
from first principles I would expect there to be a difference: the
heavier isotope will make the transition from the trihedral boric acid
to the tetrahedral borate ion configuration less easily than is the
case for the lighter isotope.

Now to calculate and predict the \delta\isotope{11}{B} of seawater as
a function of pH, and temperature. Starting from equation
\ref{eqn:borate_concentration} we can bring in the isotopes, so that we get
\begin{equation}
\frac{[\isotope{11}{B}\mathrm{(OH)}^-_4]}{[\isotope{10}{B}\mathrm{(OH)}^-_4]} = \frac{[\isotope{11}{B}] \mathrm{K}_{\isotope{11}{B}}}{[\isotope{10}{B}] \mathrm{K}_{\isotope{10}{B}}} \frac{[\mathrm{H}^+] + \mathrm{K}_{\isotope{10}{B}}}{[\mathrm{H}^+] + \mathrm{K}_{\isotope{11}{B}}}
\end{equation}
But we do not have direct access to the isotopicaly pure equilibrium
constants, there is only the function obtained by
\citet{dickson90:boric}. However, we can use the relation of the
fractionation constant
\begin{equation}
\mathrm{K}_{\isotope{11-10}{B}} = \frac{\mathrm{K}_{\isotope{10}{B}}}{\mathrm{K}_{\isotope{11}{B}}}
\end{equation}
and the (untested) assumption that the equilibrium constant K_{B} is
in fact the weighted average of the isotopically pure constants, i.e.,
\begin{equation}
\mathrm{K}_{\mathrm{B}} = \frac{[\isotope{11}{B}]}{[\mathrm{B}]} \mathrm{K}_{\isotope{11}{B}} + \frac{[\isotope{10}{B}]}{[\mathrm{B}]} \mathrm{K}_{\isotope{10}{B}}
\end{equation}
Setting the proportions of isotopes to total boron concentrations as R, we obtain
\begin{equation}
\begin{split}
\mathrm{K}_{\isotope{10}{B}} & = \mathrm{K}_{\mathrm{B}} \frac{\mathrm{K}_{\isotope{11-10}{B}}}{R_{11} + R_{10} \mathrm{K}_{\isotope{11-10}{B}}} \\
\mathrm{K}_{\isotope{11}{B}} & = \mathrm{K}_{\mathrm{B}} \frac{1}{R_{11} + R_{10} \mathrm{K}_{\isotope{11-10}{B}}}
\end{split}
\end{equation}

Let's see how these equations behave, and what the response is to
different temperatures
#+BEGIN_SRC R :file output/borate_fractionation.pdf
  #K11_10 <- 1.019                     # Kakihana et al., 1977 value
  K11_10 <- 1.0272                     # Klochcko et al., 2006 value

  B10_sea <- 0.192167
  B11_sea <- 0.807833
  R_sea<- B11_sea / B10_sea

  B10_951 <- 0.19827
  B11_951 <- 0.80173
  R_951 <- B11_951 / B10_951

  K_10B <- K11_10 / (B11_sea + B10_sea * K11_10)
  K_11B <- 1 / (B11_sea + B10_sea * K11_10)

  boron_delta <- data.frame(pH = seq(7, 9, 0.1), T = 286) %>%
      rbind(data.frame(pH = seq(7, 9, 0.1), T = 288)) %>%
      rbind(data.frame(pH = seq(7, 9, 0.1), T = 290)) %>%
      mutate(K_B = exp(lnKB(T, S = 35))) %>%
      mutate(B_ratio = R_sea / K11_10 * (10^(-pH) + K_B * K_10B)/
                 (10^(-pH) + K_B * K_11B)) %>%
      mutate(delta_B = (B_ratio / R_951 - 1) * 1000,
             Temperature = as.factor(T))

  ggplot(boron_delta) +
      geom_line(aes(pH, delta_B, colour = Temperature)) +
      labs(title = "Borate fractionation in function of pH",
           x = "pH",
           y = expression(paste(delta ^{11}, "B"))) +
      theme(legend.position = "bottom")
#+END_SRC
Note that \citet{klochko-al06:fractionation} use a curve at
\unit{298}{\kelvin}, which puts it even higher than the curves shown here
(average seawater temperature is closer to \unit{290}{\kelvin}). The
rather poor fit of their curve to the values measured in experiments
with planktonic foraminifera becomes worse when using the curve
corresponding to \unit{290}{\kelvin}.

An interesting insight into the sensitivity to pH and temperature can
be gained from the following query:
#+BEGIN_SRC R
  boron_delta %>% filter(pH == 8.1 | pH == 8.3) %>%
      select(pH, T, delta_B) %>%
      arrange(pH, T)
#+END_SRC

#+RESULTS[7fca570c0df0d4da0e28370f1da963c41e7a9f74]:
:    pH   T  delta_B
: 1 8.1 286 17.16365
: 2 8.1 288 17.40407
: 3 8.1 290 17.64943
: 4 8.3 286 19.35042
: 5 8.3 288 19.65940
: 6 8.3 290 19.97184



An ever greater sensitivity is to be found in the value of the
fractionation constant, as already pointed out by
\citet{klochko-al06:fractionation}.

The study by
\citet{tonarini-al07:intercomparison,gonfiantini-al07:intercomparison}
adds further to the troubles of the \delta\isotope{11}{B} story. The
actual measurement of the isotopic proportion is and remains
surprisingly fickle, to the point where confidence intervals on
reported numbers are uncomfortably wide. Here are the results obtained
by 10 different labs, analysing an homogenous sample of
(Mediterranean) seawater.

#+TBLNAME: tonarini
| lab | \delta\isotope{11}{B} | \sigma |  n | technique |
|-----+-----------------------+--------+----+-----------|
| A   |                 36.69 |   0.15 |  5 | PTIMS     |
| B   |                 37.26 |   0.22 |  2 | PTIMS     |
| C   |                 38.84 |    0.4 |  6 | PTIMS     |
| D   |                 39.42 |   0.03 |  3 | PTIMS     |
| E   |                  40.8 |   0.12 | 11 | PTIMS     |
| F   |                 38.85 |   0.83 |  8 | NTIMS     |
| G   |                 39.34 |   0.14 |  4 | NTIMS     |
| H   |                  37.3 |    0.9 |    | ICP-MS    |
| I   |                  33.7 |    6.4 |  4 | ICP-MS    |
| J   |                 34.75 |     20 |    | ICP-MS    |

A simple plot shows all too clearly the problematic outcome of this
exercise. In view of the very large standard deviations reported for 2
of the ICP-MS analyses, these are omitted from the plot.

#+BEGIN_SRC R :var tonarini=tonarini :file output/tonarini.pdf
  names(tonarini) <- c("Lab", "delta_B", "sigma", "n", "technique")

  tonarini %>%
      filter(sigma < 6) %>%
      mutate(delta_B_m = delta_B - 2 * sigma,
             delta_B_M = delta_B + 2 * sigma) %>%
      ggplot() +
      geom_pointrange(aes(Lab, delta_B, ymin=delta_B_m, ymax=delta_B_M)) +
      labs(title = "Interlaboratory Comparative Analysis of Sea water",
           y = expression(paste(delta ^{11}, "B"))) +
      facet_wrap(~technique, scales = "free_x")
#+END_SRC

Clearly, the values and standard deviations of the analyses as
reported are wide off the mark given the PTIMS population sample mean
and standard deviation of \unit{38.6\pm1.66}{\permil}. Harking back to
the graphs of the various data sets published and shown above, one
cannot avoid the conclusion that the analytical techniques and
protocols are insufficiently reliable and mature to allow any
fine-grained analysis of palaeo-CO_{2} levels.

